{"keras_version": "1.1.2", "class_name": "Model", "config": {"name": "model_3", "input_layers": [["input_5", 0, 0], ["input_6", 0, 0]], "layers": [{"name": "input_5", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 200], "input_dtype": "float32", "sparse": false, "name": "input_5"}}, {"name": "input_6", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 200], "input_dtype": "float32", "sparse": false, "name": "input_6"}}, {"name": "embedding_3", "inbound_nodes": [[["input_5", 0, 0]], [["input_6", 0, 0]]], "class_name": "Embedding", "config": {"dropout": 0.0, "batch_input_shape": [null, 200], "output_dim": 32, "init": "uniform", "W_regularizer": null, "trainable": true, "input_dim": 25000, "input_dtype": "int32", "mask_zero": false, "activity_regularizer": null, "name": "embedding_3", "W_constraint": null, "input_length": 200}}, {"name": "lstm_3", "inbound_nodes": [[["embedding_3", 0, 0]], [["embedding_3", 1, 0]]], "class_name": "LSTM", "config": {"b_regularizer": null, "dropout_W": 0.0, "consume_less": "cpu", "W_regularizer": null, "trainable": true, "go_backwards": false, "activation": "tanh", "name": "lstm_3", "inner_init": "orthogonal", "inner_activation": "hard_sigmoid", "batch_input_shape": [null, 32, 1], "output_dim": 20, "unroll": false, "return_sequences": false, "input_dtype": "float32", "U_regularizer": null, "dropout_U": 0.0, "init": "glorot_uniform", "forget_bias_init": "one", "input_dim": 32, "stateful": false, "input_length": null}}, {"name": "merge_3", "inbound_nodes": [[["lstm_3", 0, 0], ["lstm_3", 1, 0]]], "class_name": "Merge", "config": {"mode_type": "raw", "output_mask": null, "dot_axes": -1, "concat_axis": -1, "output_shape_type": "raw", "output_mask_type": "raw", "mode": "concat", "output_shape": null, "name": "merge_3", "arguments": {}}}, {"name": "dense_3", "inbound_nodes": [[["merge_3", 0, 0]]], "class_name": "Dense", "config": {"bias": true, "activation": "sigmoid", "b_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "name": "dense_3", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "W_constraint": null}}], "output_layers": [["dense_3", 0, 0]]}}