{"keras_version": "1.1.2", "config": {"name": "model_10", "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 200], "input_dtype": "float32", "name": "input_19"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_19"}, {"config": {"sparse": false, "batch_input_shape": [null, 200], "input_dtype": "float32", "name": "input_20"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_20"}, {"config": {"mask_zero": false, "W_regularizer": null, "input_length": 200, "activity_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 64, "input_dim": 25000, "dropout": 0.0, "init": "uniform", "batch_input_shape": [null, 200], "input_dtype": "int32", "name": "embedding_19"}, "class_name": "Embedding", "inbound_nodes": [[["input_19", 0, 0]]], "name": "embedding_19"}, {"config": {"mask_zero": false, "W_regularizer": null, "input_length": 200, "activity_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 64, "input_dim": 25000, "dropout": 0.0, "init": "uniform", "batch_input_shape": [null, 200], "input_dtype": "int32", "name": "embedding_20"}, "class_name": "Embedding", "inbound_nodes": [[["input_20", 0, 0]]], "name": "embedding_20"}, {"config": {"dropout_U": 0.0, "input_length": null, "output_dim": 50, "return_sequences": false, "input_dim": 64, "dropout_W": 0.0, "init": "glorot_uniform", "inner_activation": "hard_sigmoid", "input_dtype": "float32", "unroll": false, "W_regularizer": null, "U_regularizer": null, "inner_init": "orthogonal", "activation": "tanh", "stateful": false, "b_regularizer": null, "trainable": true, "batch_input_shape": [null, 64, 1], "go_backwards": false, "consume_less": "cpu", "name": "lstm_10", "forget_bias_init": "one"}, "class_name": "LSTM", "inbound_nodes": [[["embedding_19", 0, 0]], [["embedding_20", 0, 0]]], "name": "lstm_10"}, {"config": {"mode_type": "raw", "mode": "concat", "dot_axes": -1, "output_mask": null, "arguments": {}, "output_shape_type": "raw", "concat_axis": -1, "name": "merge_10", "output_shape": null, "output_mask_type": "raw"}, "class_name": "Merge", "inbound_nodes": [[["lstm_10", 0, 0], ["lstm_10", 1, 0]]], "name": "merge_10"}, {"config": {"bias": true, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "sigmoid", "b_constraint": null, "output_dim": 1, "trainable": true, "input_dim": null, "init": "glorot_uniform", "name": "dense_10", "b_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["merge_10", 0, 0]]], "name": "dense_10"}], "output_layers": [["dense_10", 0, 0]], "input_layers": [["input_19", 0, 0], ["input_20", 0, 0]]}, "class_name": "Model"}